**Pandas**

In [1]:
import pandas as pd #Veri işlemesi ve ver analizi için kullanılan kütüphanedir.

In [4]:
dictionary = {"name":["Gülcan","Ebru","Hasan","Ahmet","Zehra","Yeliz","Mehmet"],
             "age":[24,21,29,25,None,26,22],
             "note":[123,456,78,87654,None,89,99]}

dataframe1 = pd.DataFrame(dictionary) 
print(dataframe1)

     name   age     note
0  Gülcan  24.0    123.0
1    Ebru  21.0    456.0
2   Hasan  29.0     78.0
3   Ahmet  25.0  87654.0
4   Zehra   NaN      NaN
5   Yeliz  26.0     89.0
6  Mehmet  22.0     99.0

In [5]:
head = dataframe1.head() #verinin içindeki ilk beş değeri getirir (default olarak 5 )
print(head)

#Bu işlemi bir datayı import ettiğimizde datanın içeriğine kısaca bakmak için kullanabiliriz

     name   age     note
0  Gülcan  24.0    123.0
1    Ebru  21.0    456.0
2   Hasan  29.0     78.0
3   Ahmet  25.0  87654.0
4   Zehra   NaN      NaN

In [6]:
tail = dataframe1.tail()  #head ile aynı işlevdedir sadece baştan değil sondan 5 satırı verir(default olarak 5)
print(tail)

     name   age     note
2   Hasan  29.0     78.0
3   Ahmet  25.0  87654.0
4   Zehra   NaN      NaN
5   Yeliz  26.0     89.0
6  Mehmet  22.0     99.0

In [7]:
##Pandas Basic Method

print(dataframe1.columns) # sutunlarin isimlerini verir

Index(['name', 'age', 'note'], dtype='object')

In [8]:
print(dataframe1.info()) #dataframe hakkında bilgi verir

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     6 non-null      float64
 2   note    6 non-null      float64
dtypes: float64(2), object(1)
memory usage: 300.0+ bytes
None

In [9]:
print(dataframe1.dtypes) #dataframe'in her bir column'ın type'ını verir

name     object
age     float64
note    float64
dtype: object

In [10]:
print(dataframe1.describe()) #age ve note future'larını verir fakat name future'ını vermez çünkü name nümerik değil. 
#Describe sadece nümerik future'larını verir bu tabloda ise data future değerlerinin ortalamalrı min max ları medyan değerleri vb verir.

             age          note
count   6.000000      6.000000
mean   24.500000  14749.833333
std     2.880972  35715.893064
min    21.000000     78.000000
25%    22.500000     91.500000
50%    24.500000    111.000000
75%    25.750000    372.750000
max    29.000000  87654.000000

In [15]:
##Indexing And Slicing

print(dataframe1["name"]) #sadece isimleri yazar.
print(dataframe1.loc[:,"age"]) #age sütununun tüm satırlarını getirir
print(dataframe1.loc[::-1]) #indexleri tersten yazdırır.

0    Gülcan
1      Ebru
2     Hasan
3     Ahmet
4     Zehra
5     Yeliz
6    Mehmet
Name: name, dtype: object
0    24.0
1    21.0
2    29.0
3    25.0
4     NaN
5    26.0
6    22.0
Name: age, dtype: float64
     name   age     note
6  Mehmet  22.0     99.0
5   Yeliz  26.0     89.0
4   Zehra   NaN      NaN
3   Ahmet  25.0  87654.0
2   Hasan  29.0     78.0
1    Ebru  21.0    456.0
0  Gülcan  24.0    123.0

In [21]:
##Filtering Pandas Data Frame

filtre = dataframe1.age>21                           #yaşı 21'den büyük olanlar filtrelendi
dataframe1["bool"]= filtre
print(dataframe1.loc[:,["age","bool"]])

    age   bool
0  24.0   True
1  21.0  False
2  29.0   True
3  25.0   True
4   NaN  False
5  26.0   True
6  22.0   True

In [22]:
type(filtre) #nupmy'da vektör denilirken pandas'da ise tipine series deniliyor. Serilerin birleşimine ise dataframe denir.

pandas.core.series.Series

In [23]:
filtrelenmis_data= dataframe1[filtre] #dataframe'i filtrelemiş olduk, sadece koşulu sağlayan indeksler yazıldı
print(filtrelenmis_data)

     name   age     note  bool
0  Gülcan  24.0    123.0  True
2   Hasan  29.0     78.0  True
3   Ahmet  25.0  87654.0  True
5   Yeliz  26.0     89.0  True
6  Mehmet  22.0     99.0  True

In [24]:
filtre2 = dataframe1.note>90
filtrelenmis_data2 = dataframe1[filtre2&filtre] #iki filtre birden uyguladık
print(filtrelenmis_data2)

     name   age     note  bool
0  Gülcan  24.0    123.0  True
3   Ahmet  25.0  87654.0  True
6  Mehmet  22.0     99.0  True

In [25]:
dataframe1[dataframe1.age>24] #bu şekildede filtreleme uygulayabiliriz

    name   age     note  bool
2  Hasan  29.0     78.0  True
3  Ahmet  25.0  87654.0  True
5  Yeliz  26.0     89.0  True

In [26]:
##List Comprehension

import numpy as np
ortalama = dataframe1.note.mean() #pandas ile ortalama bulma 
print(ortalama)
ortlama_np= np.mean(dataframe1.note) #numpy ile ortalama bulma
print(ortlama_np)

14749.833333333334
14749.833333333334

In [27]:
dataframe1.dropna(inplace=True) #dropna ile NaN değerleri sildik 
dataframe1
#inplace=True parametresini vermezsek NaN değerleri tekrar gelecektir.
#Bunun için pandas'ın inplace=True paramtresini kullanarak değişiklikleri kalıcı hale getirebiliriz.

     name   age     note   bool
0  Gülcan  24.0    123.0   True
1    Ebru  21.0    456.0  False
2   Hasan  29.0     78.0   True
3   Ahmet  25.0  87654.0   True
5   Yeliz  26.0     89.0   True
6  Mehmet  22.0     99.0   True

In [28]:
print(dataframe1.note.mean()) #ortalama not hesabı
#ortalamaya bakarak üstünde vya altında olduğunu yazdırma
dataframe1["ortalama"]= ["ortalamanın altında" if dataframe1.note.mean()>each else "ortalamanın üstünde" for each in dataframe1.note]
dataframe1

#List comprehension sayesinde tek bir satırda for ve if kullanıp,
#extra print yazmadan dataframe1 de yeni bir future açıp doldurduk.

14749.833333333334

     name   age     note   bool             ortalama
0  Gülcan  24.0    123.0   True  ortalamanın altında
1    Ebru  21.0    456.0  False  ortalamanın altında
2   Hasan  29.0     78.0   True  ortalamanın altında
3   Ahmet  25.0  87654.0   True  ortalamanın üstünde
5   Yeliz  26.0     89.0   True  ortalamanın altında
6  Mehmet  22.0     99.0   True  ortalamanın altında

In [29]:
dataframe1.columns = [each.upper() for each in dataframe1.columns]
dataframe1.columns

#upper() metodu ile tüm kolon adlarını büyük harfe çeviririz. Datasetimiz karışık olduğunda
#toplu halde düzeltmemizi sağlar.

Index(['NAME', 'AGE', 'NOTE', 'BOOL', 'ORTALAMA'], dtype='object')

In [32]:
##Concatenating Data

#verticle(dikey) birleştirme  concat() metodu ile iki dataframe'i birleştirir.

data1 = dataframe1.head()     
data2 = dataframe1.tail()
data_concat = pd.concat([data1,data2],axis=0)
data_concat

     NAME   AGE     NOTE   BOOL             ORTALAMA
0  Gülcan  24.0    123.0   True  ortalamanın altında
1    Ebru  21.0    456.0  False  ortalamanın altında
2   Hasan  29.0     78.0   True  ortalamanın altında
3   Ahmet  25.0  87654.0   True  ortalamanın üstünde
5   Yeliz  26.0     89.0   True  ortalamanın altında
1    Ebru  21.0    456.0  False  ortalamanın altında
2   Hasan  29.0     78.0   True  ortalamanın altında
3   Ahmet  25.0  87654.0   True  ortalamanın üstünde
5   Yeliz  26.0     89.0   True  ortalamanın altında
6  Mehmet  22.0     99.0   True  ortalamanın altında

In [33]:
#horizontal(yatay) birleştirme

data_contact = pd.concat([data1,data2],axis=1) #axis= 1 yazarak sütunları birleştirdik
data_contact

#axis= 0 olursa satır, 1 olursa stunu seçer ve istenileni inplace yardımıyla kalıcı olarak siler

,NAME,AGE,NOTE,BOOL,ORTALAMA,NAME,AGE,NOTE,BOOL,ORTALAMA
0,Gülcan,24.0,123.0,True,ortalamanın altında,NaN,NaN,NaN,NaN,NaN
1,Ebru,21.0,456.0,False,ortalamanın altında,Ebru,21.0,456.0,False,ortalamanın altında
2,Hasan,29.0,78.0,True,ortalamanın altında,Hasan,29.0,78.0,True,ortalamanın altında
3,Ahmet,25.0,87654.0,True,ortalamanın üstünde,Ahmet,25.0,87654.0,True,ortalamanın üstünde
5,Yeliz,26.0,89.0,True,ortalamanın altında,Yeliz,26.0,89.0,True,ortalamanın altında
6,NaN,NaN,NaN,NaN,NaN,Mehmet,22.0,99.0,True,ortalamanın altında

In [34]:
##Transforming Data

dataframe1["yasx2"] = [each*2 for each in dataframe1.AGE]
dataframe1

     NAME   AGE     NOTE   BOOL             ORTALAMA  yasx2
0  Gülcan  24.0    123.0   True  ortalamanın altında   48.0
1    Ebru  21.0    456.0  False  ortalamanın altında   42.0
2   Hasan  29.0     78.0   True  ortalamanın altında   58.0
3   Ahmet  25.0  87654.0   True  ortalamanın üstünde   50.0
5   Yeliz  26.0     89.0   True  ortalamanın altında   52.0
6  Mehmet  22.0     99.0   True  ortalamanın altında   44.0

In [35]:
def mlt(yas):
    return yas*2
dataframe1["apply_metodu"] = dataframe1.AGE.apply(mlt)
dataframe1

     NAME   AGE     NOTE   BOOL             ORTALAMA  yasx2  apply_metodu
0  Gülcan  24.0    123.0   True  ortalamanın altında   48.0          48.0
1    Ebru  21.0    456.0  False  ortalamanın altında   42.0          42.0
2   Hasan  29.0     78.0   True  ortalamanın altında   58.0          58.0
3   Ahmet  25.0  87654.0   True  ortalamanın üstünde   50.0          50.0
5   Yeliz  26.0     89.0   True  ortalamanın altında   52.0          52.0
6  Mehmet  22.0     99.0   True  ortalamanın altında   44.0          44.0